# Basic necessities
brew 'zsh'
brew 'zsh-completions'
brew 'bash'
brew 'git'
brew 'nvim'
brew 'tmux'
brew 'pwgen'
brew 'wget'
# TODO: pick a dotfile manager
# brew 'chezmoi'
# brew 'yadm'

# Fonts!
tap "homebrew/cask-fonts"
cask "font-victor-mono"

# Helpers for dotfiles related stuff
brew 'moreutils'
brew 'keychain'
brew 'icdiff'
brew 'git-delta'
brew 'bat'
brew 'exa'

# For development
brew 'go'
## TODO: use asdf instead?
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'rbenv'
brew 'rbenv-gemset'
brew 'nvm'
## Dev utils
brew 'ctags'
brew 'jq'
brew 'ripgrep'
## Ops utils
brew 'sipcalc'
brew 'tfenv'
brew 'rename'

# Apps
cask 'firefox'
cask 'google-chrome'
cask 'kitty'
cask 'omnidb'
cask 'tunnelblick'
cask 'macvim'
cask 'sourcetree'
cask 'virtualbox'
cask 'virtualbox-extension-pack'

# Other fun stuff
brew 'cowsay'
brew 'fortune'
brew 'graphviz'
