# Basic necessities
brew 'zsh'
brew 'zsh-completions'
brew 'starship'
brew 'bash'
brew 'git'
brew 'nvim'
brew 'tmux'
brew 'pwgen'
brew 'wget'
brew 'dust'
# TODO: pick a dotfile manager
# brew 'chezmoi'
# brew 'yadm'
cask '1password/tap/1password-cli'

# Fonts!
tap "homebrew/cask-fonts"
cask "font-victor-mono"

# Helpers for dotfiles related stuff
brew 'moreutils'
brew 'keychain'
brew 'icdiff'
brew 'git-delta'
brew 'bat'
brew 'eza'
brew 'shellcheck'

# For development
brew 'go'
brew 'asdf'
## Dev utils
brew 'ctags'
brew 'jq'
brew 'gojq'
brew 'ijq'
brew 'ripgrep'
## Ops utils
brew 'sipcalc'
brew 'rename'
brew 'doggo'
cask 'aws-vault'
brew 'hadolint'

# Apps
cask 'firefox'
cask 'google-chrome'
cask 'kitty'
cask 'omnidb'
cask 'tunnelblick'
cask 'macvim'
cask 'sourcetree'
cask 'virtualbox'
cask 'virtualbox-extension-pack'

# Other fun stuff
brew 'cowsay'
brew 'fortune'
brew 'graphviz'
