# Basic necessities
brew 'zsh'
brew 'zsh-completions'
brew 'starship'
brew 'bash'
brew 'git'
brew 'nvim'
brew 'vim'
brew 'tmux'
cask 'tmuxpack/tpack/tpack'
brew 'pwgen'
brew 'wget'
brew 'curl'
brew 'rsync'
{{ if eq .chezmoi.os "darwin" -}}
brew 'telnet'
brew 'terminal-notifier'
{{ end -}}
brew 'dust'
brew 'chezmoi'
{{ if eq .chezmoi.os "darwin" -}}
cask '1password/tap/1password-cli'
cask 'readdle-spark'
{{ end -}}
brew 'atuin'

# Fonts!
cask "font-victor-mono"
cask "font-victor-mono-nerd-font"

# Helpers for dotfiles related stuff
brew 'moreutils'
brew 'coreutils'
brew 'keychain'
brew 'icdiff'
brew 'git-delta'
brew 'bat'
brew 'eza'
brew 'shellcheck'
brew 'vivid'
brew 'fd'
brew 'ykman'

# For development
brew 'go'
brew 'asdf'
# deps for building various things
brew 'lua'
brew 'luarocks'
# needed by nvim-treesitter (main branch) to compile parsers not bundled with neovim
brew 'tree-sitter'
brew 'tree-sitter-cli'
brew 'libyaml'
## Dev utils
brew 'ctags'
brew 'jq'
brew 'gojq'
brew 'ijq'
brew 'ripgrep'
brew 'make'
brew 'dos2unix'
## Ops utils
brew 'sipcalc'
brew 'doggo'
brew 'awscli'
brew 'b2-tools'
{{ if eq .chezmoi.os "darwin" -}}
# These won't install on linux...
cask 'aws-vault-binary'
cask 'gcloud-cli'
brew 'rename'
{{ end -}}
brew 'powershell'
brew 'hadolint'
brew 'sshuttle'
brew 'magic-wormhole'
brew '7zip'
brew 'gh'
brew 'exercism'
brew 'uv'
cask 'codex'
{{ if eq .chezmoi.os "darwin" -}}
cask 'coscreen'
cask 'pop-app'
{{ end -}}

# art related stuff
brew 'ffmpeg'
brew 'imagemagick'
{{ if eq .chezmoi.hostname "hydra" -}}
# Daisy seed
cask 'cycling74-max'
brew 'make'
cask 'gcc-arm-embedded'
brew 'dfu-util'
brew 'open-ocd'
{{ end -}}

{{ if eq .chezmoi.os "darwin" -}}
# Apps
cask 'firefox'
cask 'google-chrome'
cask 'kitty'
cask 'tunnelblick'
cask 'vimr'
cask 'sourcetree'
cask 'rectangle'
cask 'karabiner-elements'
cask 'remember-the-milk'
cask 'obsidian'
cask 'orbstack'
cask 'tableplus'
cask 'plex'
cask 'plexamp'
cask 'spotify'
cask 'tidal'
cask 'steam'
cask 'maccy'
cask 'discord'
cask 'telegram'
cask 'stats'
cask 'visual-studio-code'
cask 'slack'
cask 'meetingbar'
cask 'reader'
cask 'pocket-casts'
cask 'fastmail'
cask 'claude'
cask 'obs'
cask 'logi-options+'
cask 'insta360-link-controller'
cask 'vlc'
cask 'gimp'
## color picker replacement for hex color
cask 'pika'
{{ if or .work (eq .chezmoi.hostname "hydra") -}}
cask 'soundsource'
{{ end -}}
{{ if eq .chezmoi.hostname "hydra" -}}
cask 'protokol'
cask 'midikeys'
cask 'sysex-librarian'
cask 'focusrite-control'
cask 'ilok-license-manager'
cask 'arturia-software-center'
cask 'teensy'
cask 'audio-hijack'
cask 'loopback'
cask 'synology-drive'
{{ end -}}

{{ end -}}
# Other fun stuff
brew 'cowsay'
brew 'fortune'
brew 'graphviz'
brew 'toilet'
brew 'figlet'
brew 'lolcat'
